---
kind: type
id: T:Autodesk.Revit.DB.EntryAndSchemeConsistency
source: html/be67c45f-7c5d-51f6-686d-d33993737f16.htm
---
# Autodesk.Revit.DB.EntryAndSchemeConsistency

Enumeration used to specify why an entry is inconsistent with a scheme or another entry.

## Syntax (C#)
```csharp
public enum EntryAndSchemeConsistency
```